ycsb/logs/TCP_16_async_th_28/workloade.log
Select TCP mode
Select TCP mode
Select TCP mode
[...]
[OVERALL], RunTime(ms), 111819
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 894.3023994133376
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 238
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.21284397106037437
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 238
[TOTAL_GC_TIME_%], Time(%), 0.21284397106037437
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 541.0
[CLEANUP], MinLatency(us), 541
[CLEANUP], MaxLatency(us), 541
[CLEANUP], 95thPercentileLatency(us), 541
[CLEANUP], 99thPercentileLatency(us), 541
[INSERT], Operations, 4964
[INSERT], AverageLatency(us), 119.00705076551168
[INSERT], MinLatency(us), 77
[INSERT], MaxLatency(us), 560
[INSERT], 95thPercentileLatency(us), 142
[INSERT], 99thPercentileLatency(us), 192
[INSERT], Return=OK, 4964
[SCAN], Operations, 95036
[SCAN], AverageLatency(us), 1167.878035691738
[SCAN], MinLatency(us), 192
[SCAN], MaxLatency(us), 14687
[SCAN], 95thPercentileLatency(us), 2015
[SCAN], 99thPercentileLatency(us), 2379
[SCAN], Return=OK, 95036
[OVERALL], RunTime(ms), 114234
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 875.3961167428262
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 227
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.19871491850062153
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 227
[TOTAL_GC_TIME_%], Time(%), 0.19871491850062153
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 548.0
[CLEANUP], MinLatency(us), 548
[CLEANUP], MaxLatency(us), 548
[CLEANUP], 95thPercentileLatency(us), 548
[CLEANUP], 99thPercentileLatency(us), 548
[INSERT], Operations, 5153
[INSERT], AverageLatency(us), 120.52998253444595
[INSERT], MinLatency(us), 80
[INSERT], MaxLatency(us), 593
[INSERT], 95thPercentileLatency(us), 145
[INSERT], 99thPercentileLatency(us), 192
[INSERT], Return=OK, 5153
[SCAN], Operations, 94847
[SCAN], AverageLatency(us), 1195.533142851118
[SCAN], MinLatency(us), 180
[SCAN], MaxLatency(us), 14551
[SCAN], 95thPercentileLatency(us), 2065
[SCAN], 99thPercentileLatency(us), 2425
[SCAN], Return=OK, 94847
[OVERALL], RunTime(ms), 114633
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 872.3491490234052
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 270
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2355342702363194
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 270
[TOTAL_GC_TIME_%], Time(%), 0.2355342702363194
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1342.0
[CLEANUP], MinLatency(us), 1342
[CLEANUP], MaxLatency(us), 1342
[CLEANUP], 95thPercentileLatency(us), 1342
[CLEANUP], 99thPercentileLatency(us), 1342
[INSERT], Operations, 4955
[INSERT], AverageLatency(us), 116.97840565085772
[INSERT], MinLatency(us), 72
[INSERT], MaxLatency(us), 982
[INSERT], 95thPercentileLatency(us), 140
[INSERT], 99thPercentileLatency(us), 186
[INSERT], Return=OK, 4955
[SCAN], Operations, 95045
[SCAN], AverageLatency(us), 1197.2603503603557
[SCAN], MinLatency(us), 181
[SCAN], MaxLatency(us), 31535
[SCAN], 95thPercentileLatency(us), 2071
[SCAN], 99thPercentileLatency(us), 2411
[SCAN], Return=OK, 95045
[OVERALL], RunTime(ms), 114691
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 871.9079962682338
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 242
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.21100173509691258
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 242
[TOTAL_GC_TIME_%], Time(%), 0.21100173509691258
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 886.0
[CLEANUP], MinLatency(us), 886
[CLEANUP], MaxLatency(us), 886
[CLEANUP], 95thPercentileLatency(us), 886
[CLEANUP], 99thPercentileLatency(us), 886
[INSERT], Operations, 5004
[INSERT], AverageLatency(us), 124.23621103117506
[INSERT], MinLatency(us), 79
[INSERT], MaxLatency(us), 743
[INSERT], 95thPercentileLatency(us), 161
[INSERT], 99thPercentileLatency(us), 195
[INSERT], Return=OK, 5004
[SCAN], Operations, 94996
[SCAN], AverageLatency(us), 1198.0605078108551
[SCAN], MinLatency(us), 192
[SCAN], MaxLatency(us), 16895
[SCAN], 95thPercentileLatency(us), 2073
[SCAN], 99thPercentileLatency(us), 2509
[SCAN], Return=OK, 94996
[OVERALL], RunTime(ms), 114969
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 869.799685132514
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 272
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2365855143560438
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 272
[TOTAL_GC_TIME_%], Time(%), 0.2365855143560438
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 587.0
[CLEANUP], MinLatency(us), 587
[CLEANUP], MaxLatency(us), 587
[CLEANUP], 95thPercentileLatency(us), 587
[CLEANUP], 99thPercentileLatency(us), 587
[INSERT], Operations, 5033
[INSERT], AverageLatency(us), 136.30915954698986
[INSERT], MinLatency(us), 75
[INSERT], MaxLatency(us), 7455
[INSERT], 95thPercentileLatency(us), 222
[INSERT], 99thPercentileLatency(us), 313
[INSERT], Return=OK, 5033
[SCAN], Operations, 94967
[SCAN], AverageLatency(us), 1200.7717628228754
[SCAN], MinLatency(us), 177
[SCAN], MaxLatency(us), 33311
[SCAN], 95thPercentileLatency(us), 2067
[SCAN], 99thPercentileLatency(us), 2441
[SCAN], Return=OK, 94967
[OVERALL], RunTime(ms), 115363
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 866.8290526425284
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 245
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.21237311789741947
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 245
[TOTAL_GC_TIME_%], Time(%), 0.21237311789741947
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 606.0
[CLEANUP], MinLatency(us), 606
[CLEANUP], MaxLatency(us), 606
[CLEANUP], 95thPercentileLatency(us), 606
[CLEANUP], 99thPercentileLatency(us), 606
[INSERT], Operations, 5061
[INSERT], AverageLatency(us), 121.89014028848054
[INSERT], MinLatency(us), 79
[INSERT], MaxLatency(us), 888
[INSERT], 95thPercentileLatency(us), 155
[INSERT], 99thPercentileLatency(us), 193
[INSERT], Return=OK, 5061
[SCAN], Operations, 94939
[SCAN], AverageLatency(us), 1205.8906034401036
[SCAN], MinLatency(us), 182
[SCAN], MaxLatency(us), 19615
[SCAN], 95thPercentileLatency(us), 2099
[SCAN], 99thPercentileLatency(us), 2521
[SCAN], Return=OK, 94939
[OVERALL], RunTime(ms), 116145
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 860.992724611477
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 247
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.21266520297903482
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 247
[TOTAL_GC_TIME_%], Time(%), 0.21266520297903482
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1538.0
[CLEANUP], MinLatency(us), 1538
[CLEANUP], MaxLatency(us), 1538
[CLEANUP], 95thPercentileLatency(us), 1538
[CLEANUP], 99thPercentileLatency(us), 1538
[INSERT], Operations, 4975
[INSERT], AverageLatency(us), 137.2038190954774
[INSERT], MinLatency(us), 82
[INSERT], MaxLatency(us), 1154
[INSERT], 95thPercentileLatency(us), 219
[INSERT], 99thPercentileLatency(us), 303
[INSERT], Return=OK, 4975
[SCAN], Operations, 95025
[SCAN], AverageLatency(us), 1212.52469350171
[SCAN], MinLatency(us), 186
[SCAN], MaxLatency(us), 25311
[SCAN], 95thPercentileLatency(us), 2089
[SCAN], 99thPercentileLatency(us), 2509
[SCAN], Return=OK, 95025
[OVERALL], RunTime(ms), 116976
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 854.8762139242237
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 222
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.18978251949117766
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 222
[TOTAL_GC_TIME_%], Time(%), 0.18978251949117766
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 760.0
[CLEANUP], MinLatency(us), 760
[CLEANUP], MaxLatency(us), 760
[CLEANUP], 95thPercentileLatency(us), 760
[CLEANUP], 99thPercentileLatency(us), 760
[INSERT], Operations, 4917
[INSERT], AverageLatency(us), 119.31970713849908
[INSERT], MinLatency(us), 75
[INSERT], MaxLatency(us), 1568
[INSERT], 95thPercentileLatency(us), 152
[INSERT], 99thPercentileLatency(us), 194
[INSERT], Return=OK, 4917
[SCAN], Operations, 95083
[SCAN], AverageLatency(us), 1221.1267208649285
[SCAN], MinLatency(us), 169
[SCAN], MaxLatency(us), 15863
[SCAN], 95thPercentileLatency(us), 2109
[SCAN], 99thPercentileLatency(us), 2519
[SCAN], Return=OK, 95083
[OVERALL], RunTime(ms), 118570
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 843.3836552247617
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 218
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.18385763683899806
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 218
[TOTAL_GC_TIME_%], Time(%), 0.18385763683899806
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 743.0
[CLEANUP], MinLatency(us), 743
[CLEANUP], MaxLatency(us), 743
[CLEANUP], 95thPercentileLatency(us), 743
[CLEANUP], 99thPercentileLatency(us), 743
[INSERT], Operations, 4849
[INSERT], AverageLatency(us), 116.1775623839967
[INSERT], MinLatency(us), 70
[INSERT], MaxLatency(us), 655
[INSERT], 95thPercentileLatency(us), 143
[INSERT], 99thPercentileLatency(us), 187
[INSERT], Return=OK, 4849
[SCAN], Operations, 95151
[SCAN], AverageLatency(us), 1237.5569463274164
[SCAN], MinLatency(us), 199
[SCAN], MaxLatency(us), 13071
[SCAN], 95thPercentileLatency(us), 2143
[SCAN], 99thPercentileLatency(us), 2517
[SCAN], Return=OK, 95151
[OVERALL], RunTime(ms), 119756
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 835.0312301680083
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 250
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.20875780754200207
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 250
[TOTAL_GC_TIME_%], Time(%), 0.20875780754200207
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1190.0
[CLEANUP], MinLatency(us), 1190
[CLEANUP], MaxLatency(us), 1190
[CLEANUP], 95thPercentileLatency(us), 1190
[CLEANUP], 99thPercentileLatency(us), 1190
[INSERT], Operations, 5035
[INSERT], AverageLatency(us), 115.64349553128103
[INSERT], MinLatency(us), 66
[INSERT], MaxLatency(us), 1131
[INSERT], 95thPercentileLatency(us), 139
[INSERT], 99thPercentileLatency(us), 189
[INSERT], Return=OK, 5035
[SCAN], Operations, 94965
[SCAN], AverageLatency(us), 1252.1933027957668
[SCAN], MinLatency(us), 190
[SCAN], MaxLatency(us), 45215
[SCAN], 95thPercentileLatency(us), 2181
[SCAN], 99thPercentileLatency(us), 2543
[SCAN], Return=OK, 94965
[OVERALL], RunTime(ms), 120358
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 830.854617059107
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 228
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1894348526894764
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 228
[TOTAL_GC_TIME_%], Time(%), 0.1894348526894764
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 902.0
[CLEANUP], MinLatency(us), 902
[CLEANUP], MaxLatency(us), 902
[CLEANUP], 95thPercentileLatency(us), 902
[CLEANUP], 99thPercentileLatency(us), 902
[INSERT], Operations, 5037
[INSERT], AverageLatency(us), 117.10958904109589
[INSERT], MinLatency(us), 70
[INSERT], MaxLatency(us), 1412
[INSERT], 95thPercentileLatency(us), 139
[INSERT], 99thPercentileLatency(us), 188
[INSERT], Return=OK, 5037
[SCAN], Operations, 94963
[SCAN], AverageLatency(us), 1258.4698988026917
[SCAN], MinLatency(us), 196
[SCAN], MaxLatency(us), 16239
[SCAN], 95thPercentileLatency(us), 2183
[SCAN], 99thPercentileLatency(us), 2545
[SCAN], Return=OK, 94963
[OVERALL], RunTime(ms), 120362
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 830.827005200977
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 236
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1960751732274306
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 236
[TOTAL_GC_TIME_%], Time(%), 0.1960751732274306
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1057.0
[CLEANUP], MinLatency(us), 1057
[CLEANUP], MaxLatency(us), 1057
[CLEANUP], 95thPercentileLatency(us), 1057
[CLEANUP], 99thPercentileLatency(us), 1057
[INSERT], Operations, 5041
[INSERT], AverageLatency(us), 122.13449712358658
[INSERT], MinLatency(us), 76
[INSERT], MaxLatency(us), 609
[INSERT], 95thPercentileLatency(us), 148
[INSERT], 99thPercentileLatency(us), 193
[INSERT], Return=OK, 5041
[SCAN], Operations, 94959
[SCAN], AverageLatency(us), 1258.255331248223
[SCAN], MinLatency(us), 186
[SCAN], MaxLatency(us), 22799
[SCAN], 95thPercentileLatency(us), 2169
[SCAN], 99thPercentileLatency(us), 2557
[SCAN], Return=OK, 94959
[OVERALL], RunTime(ms), 120699
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 828.5072784364411
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 236
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.19552771771100008
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 236
[TOTAL_GC_TIME_%], Time(%), 0.19552771771100008
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 773.0
[CLEANUP], MinLatency(us), 773
[CLEANUP], MaxLatency(us), 773
[CLEANUP], 95thPercentileLatency(us), 773
[CLEANUP], 99thPercentileLatency(us), 773
[INSERT], Operations, 5072
[INSERT], AverageLatency(us), 122.23205835962145
[INSERT], MinLatency(us), 77
[INSERT], MaxLatency(us), 617
[INSERT], 95thPercentileLatency(us), 159
[INSERT], 99thPercentileLatency(us), 198
[INSERT], Return=OK, 5072
[SCAN], Operations, 94928
[SCAN], AverageLatency(us), 1262.6296350918592
[SCAN], MinLatency(us), 185
[SCAN], MaxLatency(us), 15799
[SCAN], 95thPercentileLatency(us), 2193
[SCAN], 99thPercentileLatency(us), 2569
[SCAN], Return=OK, 94928
[OVERALL], RunTime(ms), 120826
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 827.6364358664525
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 269
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.22263420124807573
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 269
[TOTAL_GC_TIME_%], Time(%), 0.22263420124807573
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 980.0
[CLEANUP], MinLatency(us), 980
[CLEANUP], MaxLatency(us), 980
[CLEANUP], 95thPercentileLatency(us), 980
[CLEANUP], 99thPercentileLatency(us), 980
[INSERT], Operations, 4971
[INSERT], AverageLatency(us), 117.76765238382619
[INSERT], MinLatency(us), 67
[INSERT], MaxLatency(us), 828
[INSERT], 95thPercentileLatency(us), 149
[INSERT], 99thPercentileLatency(us), 189
[INSERT], Return=OK, 4971
[SCAN], Operations, 95029
[SCAN], AverageLatency(us), 1262.460333161456
[SCAN], MinLatency(us), 193
[SCAN], MaxLatency(us), 330751
[SCAN], 95thPercentileLatency(us), 2167
[SCAN], 99thPercentileLatency(us), 2559
[SCAN], Return=OK, 95029
[OVERALL], RunTime(ms), 120934
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 826.8973158913126
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 246
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2034167397092629
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 246
[TOTAL_GC_TIME_%], Time(%), 0.2034167397092629
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 716.0
[CLEANUP], MinLatency(us), 716
[CLEANUP], MaxLatency(us), 716
[CLEANUP], 95thPercentileLatency(us), 716
[CLEANUP], 99thPercentileLatency(us), 716
[INSERT], Operations, 5047
[INSERT], AverageLatency(us), 122.75530017832375
[INSERT], MinLatency(us), 77
[INSERT], MaxLatency(us), 922
[INSERT], 95thPercentileLatency(us), 162
[INSERT], 99thPercentileLatency(us), 198
[INSERT], Return=OK, 5047
[SCAN], Operations, 94953
[SCAN], AverageLatency(us), 1264.677608922309
[SCAN], MinLatency(us), 182
[SCAN], MaxLatency(us), 27855
[SCAN], 95thPercentileLatency(us), 2197
[SCAN], 99thPercentileLatency(us), 2589
[SCAN], Return=OK, 94953
[OVERALL], RunTime(ms), 121334
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 824.1712957621112
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 253
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.20851533782781412
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 253
[TOTAL_GC_TIME_%], Time(%), 0.20851533782781412
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 899.0
[CLEANUP], MinLatency(us), 899
[CLEANUP], MaxLatency(us), 899
[CLEANUP], 95thPercentileLatency(us), 899
[CLEANUP], 99thPercentileLatency(us), 899
[INSERT], Operations, 4995
[INSERT], AverageLatency(us), 121.45945945945945
[INSERT], MinLatency(us), 76
[INSERT], MaxLatency(us), 615
[INSERT], 95thPercentileLatency(us), 155
[INSERT], 99thPercentileLatency(us), 196
[INSERT], Return=OK, 4995
[SCAN], Operations, 95005
[SCAN], AverageLatency(us), 1268.2847218567445
[SCAN], MinLatency(us), 193
[SCAN], MaxLatency(us), 30719
[SCAN], 95thPercentileLatency(us), 2189
[SCAN], 99thPercentileLatency(us), 2553
[SCAN], Return=OK, 95005